#ifndef __ADC_H
#define __ADC_H	
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////	 


//ADC 代码	   


//修改日期:2012/9/7
//版本：V1.1


//All rights reserved	
//********************************************************************************
//V1.1 20120907
//在Adc_Init函数增加了内部温度测量的初始化参数。									  
////////////////////////////////////////////////////////////////////////////////// 

							  
#define ADC_CH1  		1  			//通道1		 	    
#define ADC_CH_TEMP  	16 			//温度传感器通道
	   									   
void Adc_Init(void); 				//ADC通道初始化
u16  Get_Adc(u8 ch); 				//获得某个通道值 
u16 Get_Adc_Average(u8 ch,u8 times);//得到某个通道10次采样的平均值 	  
#endif 















